Revit 2027 API
BoundingBoxUV(Double, Double, Double, Double) Constructor
Creates object with supplied values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
Public Sub New (
	min_u As Double,
	min_v As Double,
	max_u As Double,
	max_v As Double
)
public:
BoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
new :
        min_u : float *
        min_v : float *
        max_u : float *
        max_v : float -> BoundingBoxUV
Parameters
min_u Double
The first coordinate of min.
min_v Double
The second coordinate of min.
max_u Double
The first coordinate of max.
max_v Double
The second coordinate of max.
See Also
Reference
BoundingBoxUV Class
BoundingBoxUV Overload
Autodesk.Revit.DB Namespace